app/controllers/gamer_info_controller.rb

  def show
  	@gamer_info = Gamer_info.find(params[:user_id])
---
SELECT  "gamer_infos".* FROM "gamer_infos" WHERE "gamer_infos"."user_id" = $1 LIMIT 1  [["user_id", 7]]