app/controllers/posts_controller.rb

  def create
    post = current_user.posts.create(title: params[:title],
                     content: params[:content])
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["content", "test content"], ["user_id", 6], ["created_at", "2015-12-04 14:36:01.356135"], ["updated_at", "2015-12-04 14:36:01.356135"]]