app/controllers/registrations_controller.rb

  def create
  	@user = User.new(username: params[:username],
                     email: params[:email],
                     password: params[:password],
                     first_name: params[:first_name],
                     last_name: params[:last_name]
                     )
  	if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "first_name", "last_name", "gamertag", "access_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"